sunrash/freebsd_steroid/usr.sbin/manctl/manctl.8
.\" Copyright (c) 1996 Wolfram Schneider <wosch@FreeBSD.org>. Berlin.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: releng/12.0/usr.sbin/manctl/manctl.8 323342 2017-09-09 03:09:02Z gordon $
.Dd January 1, 1996
.Dt MANCTL 8
.Os
.Sh NAME
.Nm manctl
.Nd manipulating manual pages
.Sh SYNOPSIS
.Nm
.Op Fl compress
.Op Fl uncompress
.Op Fl help
.Ar path ...
.Sh DESCRIPTION
The
.Nm
utility compress or uncompress manual pages in directory path.
If possible, .so's are replaced with hard links.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl help
Print options and exit.
.It Fl compress
Compress uncompressed man pages (eliminating .so's).
.It Fl uncompress
Uncompress compressed man pages.
.El
.Sh SEE ALSO
.Xr man 1
